hw2/rails-intro/app/controllers/movies_controller.rb

SELECT rating, "movies"."rating" FROM "movies"
SELECT "movies".* FROM "movies" WHERE "rating"."G" = '1' AND "rating"."R" = '1' AND "rating"."PG-13" = '1' ORDER BY title ASC
---
  def index
    @all_ratings = Movie.pluck(:rating).uniq
    @selected_ratings = @all_ratings if @selected_ratings.nil?
    if session[:sort_by] != params[:sort_by] and !params[:sort_by].nil?
      session[:sort_by] = params[:sort_by]
    end
    if session[:ratings] != params[:ratings] and !params[:ratings].nil?
      session[:ratings] = params[:ratings]
    end
    if params[:sort_by].nil? && params[:ratings].nil? && (!session[:sort_by].nil? || !session[:ratings].nil?)
      redirect_to movies_path(:sort_by => session[:sort_by], :ratings => session[:ratings])
    end
    @sort_by = session[:sort_by]
    @ratings = session[:ratings]
    if session[:ratings].nil?
      @selected_ratings = @all_ratings
    else
      @selected_ratings = @ratings.keys
    end
    if @sort_by.nil?
      @movies = Movie.find_all_by_rating(@selected_ratings)